package animal_shelter.telegram_bot_for_animal_shelter.scheduler;

public class ConstantAnswers {
    public static final String REMAINDER_ANSWER = "Дорогой усыновитель, мы заметили, что ты не прислал отчет за прошедший день. Пожалуйста, подойди ответственнее к этому занятию.\nВ противном случае волонтеры приюта будут обязаны связаться с тобой для выяснения обстоятельств и принятия дальнейшего решения о возможном изъятии у тебя животного!";

    public static final String ASK_VOLUNTEER_CONTACT_WITH_CLIENT = "Уважаемый волонтер, очень прошу связаться с данным пользователем в связи с тем, что он не присылал отчеты последние два дня: @";

    public static final String ASK_VOLUNTEER_SET_NEW_STATUS_TO_CLIENT = "Уважаемый волонтер, следующий пользователь закончил свой пробный период и ждем вашего решения: @";

    public static final String ACCEPTED_CLIENT_MESSAGE = "Дорогой усыновитель, я с радостью сообщаю вам о том, что вы успешно прошли все испытания и завершили свой испытательный срок! Ура!!!";

    public static final String DENIED_CLIENT_MESSAGE = "Дорогой усыновитель! К сожалению, вы недобросовестно подошли к исполнению своих обязанностей. Мы вынуждены будем связаться с вами для того, чтобы забрать животное из-под вашей опеки.";

    public static final String EXTRA_14_CLIENT_MESSAGE = "Дорогой усыновитель, вам назначено дополнительных 14 дней испытательного срока! Пожалуйста, в этот раз более ответственно подойдите к исполнению своих обязанностей. Удачи!!!";

    public static final String EXTRA_30_CLIENT_MESSAGE = "Дорогой усыновитель, вам назначено дополнительных 30 дней испытательного срока! Пожалуйста, в этот раз более ответственно подойдите к исполнению своих обязанностей. Удачи!!!";
}
